app/Http/Controllers/TopicsController.php

select * from `categories` where `categories`.`id` in (1, 2, 3, 4)
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
    public function index(Request $request, Topic $topic)
    {
        $topics = $topic->withOrder($request->order)
            ->with('user', 'category')  // 预加载防止 N+1 问题
            ->paginate(20);